#Задача 7. Режем число на части

number = input('Введите число: ')

for i in number:
    print(i)
