#Задача 3. Следующее и предыдущее числа

number = int(input('Введите число: '))
next_num = number + 1
before_num = number - 1
print('После числа ' + str(number) + ' идет число ' + str(next_num))
print('До числа ' + str(number) + ' идет число ' + str(before_num))
