#Задача 4. Площадь треугольника

cathet_1 = int(input('Длина первого катета: '))
cathet_2 = int(input('Длина второго катета: '))

s = cathet_1 * cathet_2 / 2
print('Площадь треугольника: ' + str(s))
