#Задача 5. Модуль числа

num = int(input('Введите число: '))

if num < 0:
    print(f"Ввели {num}, ответ {-num}")
else:
    print(f"Ввели {num}, ответ {num}")