#Задача 1. Датчик погоды

num = int(input('Введите число: '))

if num == 1:
    print('Возьмите зонтик!')
else:
    print('Дождя нет!')