#Задача 8. Максимальное число (по желанию)

num1 = int(input('Введите 1 число: '))
num2 = int(input('Введите 2 число: '))
num3 = int(input('Введите 3 число: '))

print(max([num1, num2, num3]))