#Задача 5. Полёт

departure_city = input('Введите город вылета: ')
arrival_city = input('Введите город прилёта: ')

print(departure_city, '-', arrival_city)
