#Задача 1. Конвертация

summ = float(input('Введите сумму покупки в евро: '))
summ = summ * 1.25 * 60.87
print(f'Сумма в рублях {summ}')
