#Задание 4. Заглавные буквы

string = input('Введите строку: ')

print(f'Результат: {string.title()}')
